[
  {
    "id": "1",
    "name": "မုန့်ဟင်းခါး",
    "image": "https://www.tastingtable.com/img/gallery/burmese-breakfast-stew-recipe/l-intro-1639583512.jpg",
    "duration": "၂ နာရီ",
    "serving": "၅ ယောက်စာ",
    "category": 1,
    "rating": "4.5",
    "ingredients": [
      "ငါးခူ သို့မဟုတ် ငါးကြင်း ၅၀၀ ဂရမ်",
      "ကြက်သွန်နီ ၁၀ လုံး",
      "ကြက်သွန်ဖြူ ၅ တက်",
      "ချင်း လက်တစ်ဆစ်",
      "စပါးလင် ၂ ချောင်း",
      "ငှက်ပျောအူ ၂၀၀ ဂရမ်",
      "ဆန်လှော်မှုန့် စားပွဲတင်ဇွန်း ၄ ဇွန်း",
      "ပဲကြက်ဥပြုတ် ၅ လုံး",
      "မုန့်ဖတ် ၅၀၀ ဂရမ်",
      "ငံပြာရည်၊ နနွင်းမှုန့်၊ ဆီ၊ ဆား"
    ],
    "steps": [
      "ငါးကို နနွင်း၊ ဆားတို့ဖြင့် ပြုတ်ပြီး အသားနွှင်ထားပါ။",
      "ကြက်သွန်နီ၊ ဖြူ၊ ချင်း၊ စပါးလင်ကို ရောထောင်းပြီး ဆီသတ်ပါ။",
      "ဆီသတ်နံ့မွှေးလာလျှင် နွှင်ထားသောငါးအသားနှင့် ငံပြာရည်ထည့်ပြီး မွှေပါ။",
      "ရေနွေးထည့်ပြီး ဆူပွက်လာလျှင် ငှက်ပျောအူထည့်ပါ။",
      "အရည်အနည်းငယ်ပျစ်လာစေရန် ဆန်လှော်မှုန့်ကို ရေအနည်းငယ်ဖြင့်ဖျော်ပြီး ထည့်ပါ။",
      "အရသာအပေါ့အငန်မြည်းပြီး မုန့်ဖတ်၊ ပဲကြက်ဥပြုတ်နှင့် အကြော်စုံတို့ဖြင့် သုံးဆောင်ပါ။"
    ]
  },
  {
    "id": "2",
    "name": "ကြက်သား အာလူးဟင်း",
    "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiF93uhzB1qJqL28Yrl52L0F2sxtJuQw2Tszt9h5bUIAra7pIrLkc9cIgJ9bQlXWW8RouTNdhVEU9jckSlzAcMRRWwn75ib1LOKpifVqQCd02VA9mDIYgivMapV4OkOT9lePXW08n3zp_mbWv94E7WRKi5uDZa3WAdraT_RYQghFPOQkUhXJdBGRx8S/s1601/CYMERA_20230224_181024.jpg",
    "duration": "၄၅ မိနစ်",
    "serving": "၄ ယောက်စာ",
    "category": 2,
    "rating": "4.7",
    "ingredients": [
      "ကြက်ပေါင် (သို့) ရင်အုံ ၅၀၀ ဂရမ်",
      "အာလူး ၃ လုံး (အလုံးလတ်)",
      "ကြက်သွန်နီ ၂ လုံး",
      "ကြက်သွန်ဖြူ ၄ တက်",
      "ချင်း လက်တစ်ဆစ်",
      "ခရမ်းချဉ်သီး ၂ လုံး",
      "ငံပြာရည်၊ နနွင်းမှုန့်၊ အရောင်တင်မှုန့်၊ ဆီ၊ ဆား"
    ],
    "steps": [
      "ကြက်သားကို အတုံးพอดีတုံးပြီး ငံပြာရည်၊ နနွင်း၊ ဆားတို့ဖြင့် နယ်ထားပါ။",
      "ကြက်သွန်နီ၊ ဖြူ၊ ချင်းကို ရောထောင်းပါ။ အာလူးနှင့် ခရမ်းချဉ်သီးကို အတုံးတုံးထားပါ။",
      "ဆီပူလာလျှင် ထောင်းထားသည်များကို ဆီသတ်ပါ။ အရောင်တင်မှုန့်ထည့်ပါ။",
      "ဆီသတ်နံ့မွှေးလာလျှင် ခရမ်းချဉ်သီးထည့်ပြီး ခေတ္တမွှေပါ။",
      "နယ်ထားသော ကြက်သားထည့်ပြီး အသားတင်းလာသည်အထိ ချက်ပါ။",
      "ရေအနည်းငယ်နှင့် အာလူးထည့်ကာ အဖုံးအုပ်ပြီး အသားနှင့်အာလူးနူးသည်အထိ တည်ထားပါ။"
    ]
  },
  {
    "id": "3",
    "name": "လက်ဖက်သုပ်",
    "image": "https://shop.shwebiz.com/cdn/shop/products/259824430_321950496427387_6134020633612108473_n.jpg?v=1701286632&width=1445",
    "duration": "၁၅ မိနစ်",
    "serving": "၂ ယောက်စာ",
    "category": 3,
    "rating": "4.8",
    "ingredients": [
      "နှပ်ပြီးသား လက်ဖက် အနည်းငယ်",
      "အကြော်စုံ (ပဲကြော်၊ ပဲဇီးကွက်ကြော်)",
      "ခရမ်းချဉ်သီး ၁ လုံး",
      "ဂေါ်ဖီထုပ် (ပါးပါးလှီး) လက်တစ်ဆုပ်စာ",
      "ပဲပုတ်စိမ်းလှော်",
      "မြေပဲဆားလှော်",
      "ငံပြာရည်၊ အချိုမှုန့်၊ ဆီ၊ သံပုရာသီး"
    ],
    "steps": [
      "ပါဝင်ပစ္စည်းများအားလုံးကို ဇလုံတစ်လုံးထဲသို့ ထည့်ပါ။",
      "ငံပြာရည်၊ အချိုမှုန့်၊ ဆီအနည်းငယ်ထည့်ပါ။",
      "သံပုရာသီးညှစ်ထည့်ပြီး သမအောင် နယ်ဖတ်ပါ။",
      "အရသာမြည်းပြီး လိုအပ်ပါက ထပ်မံဖြည့်စွက်ပါ။"
    ]
  },
  {
    "id": "4",
    "name": "ရှမ်းခေါက်ဆွဲ",
    "image": "https://images.deliveryhero.io/image/fd-mm/LH/ib9h-listing.jpg",
    "duration": "၃၀ မိနစ်",
    "serving": "၂ ယောက်စာ",
    "category": 4,
    "rating": "4.2",
    "ingredients": [
      "ရှမ်းခေါက်ဆွဲဖတ် ၂ ပွဲစာ",
      "ကြက်သား (သို့) ဝက်သား (နုပ်နုပ်စင်း) ၁၅၀ ဂရမ်",
      "ခရမ်းချဉ်သီး ၃ လုံး",
      "ကြက်သွန်ဖြူ၊ ချင်း",
      "ပဲငံပြာရည်အနောက်၊ ပဲငံပြာရည်အကြည်",
      "မုန်ညင်းချဉ်၊ မြေပဲဆားလှော်",
      "ကြက်သွန်မြိတ်၊ နံနံပင်"
    ],
    "steps": [
      "ခရမ်းချဉ်သီးကို ရေနွေးဖျောပြီး အခွံနွှာကာ ခြေထားပါ။",
      "ဆီအနည်းငယ်ဖြင့် ကြက်သွန်ဖြူ၊ ချင်းကို ဆီသတ်ပြီး နုပ်နုပ်စင်းထားသော အသားကို ထည့်ကြော်ပါ။",
      "အသားကျက်လျှင် ခြေထားသော ခရမ်းချဉ်သီးနှင့် ပဲငံပြာရည်များထည့်ပြီး ခရမ်းချဉ်သီးအနှစ်ရသည်အထိ ချက်ပါ။",
      "ခေါက်ဆွဲဖတ်ကို ရေနွေးဖျောပြီး ပန်းကန်ထဲထည့်ပါ။",
      "အပေါ်မှ ချက်ထားသော အနှစ်၊ မုန်ညင်းချဉ်၊ မြေပဲ၊ ကြက်သွန်မြိတ်၊ နံနံပင်တို့ဖြင့် 곁들여 သုံးဆောင်ပါ။"
    ]
  },
  {
    "id": "5",
    "name": "အုန်းနို့ခေါက်ဆွဲ",
    "image": "https://i.ytimg.com/vi/rHIALuszNPw/maxresdefault.jpg",
    "duration": "၁ နာရီ",
    "serving": "၄ ယောက်စာ",
    "category": 4,
    "rating": "3.9",
    "ingredients": [
      "ကြက်သား ၄၀၀ ဂရမ်",
      "အုန်းနို့ ၄၀၀ ml",
      "ကြက်ဥခေါက်ဆွဲ ၄ ပွဲစာ",
      "ကြက်သွန်နီ ၂ လုံး",
      "ကြက်သွန်ဖြူ၊ ချင်း",
      "ကုလားပဲမှုန့် (ဟင်းရည်ပျစ်ရန်)",
      "ကြက်ဥပြုတ်၊ ဖက်ထုပ်ကြော်",
      "ငါးငံပြာရည်၊ နနွင်းမှုန့်၊ ငရုတ်သီးအကြမ်းဖတ်"
    ],
    "steps": [
      "ကြက်သားကို နနွင်း၊ ဆား၊ ငံပြာရည်တို့ဖြင့် နယ်ထားပါ။",
      "ကြက်သွန်နီ၊ ဖြူ၊ ချင်းကို ဆီသတ်ပြီး ကြက်သားထည့်ကာ ဆီပြန်သည်အထိချက်ပါ။",
      "အုန်းနို့နှင့် ရေထည့်ပြီး ဆူအောင်တည်ပါ။",
      "ကုလားပဲမှုန့်ကို ရေဖြင့်ဖျော်ပြီး ဟင်းရည်ထဲထည့်ကာ မွှေပေးပါ။",
      "ခေါက်ဆွဲပြုတ်နှင့် ဟင်းရည်ကို ပန်းကန်ထဲထည့်ပြီး ကြက်ဥပြုတ်၊ ဖက်ထုပ်ကြော်၊ ငရုတ်သီးတို့ဖြင့် သုံးဆောင်ပါ။"
    ]
  },
  {
    "id": "6",
    "name": "ထမင်းသုပ်",
    "image": "https://images.deliveryhero.io/image/fd-mm/LH/mupb-listing.jpg",
    "duration": "မိနစ် ၂၀",
    "serving": "၂ ယောက်စာ",
    "category": 3,
    "rating": "3.2",
    "ingredients": [
      "ထမင်းဖြူ ၂ ပွဲစာ",
      "မန်ကျည်းရည် စားပွဲတင်ဇွန်း ၂ ဇွန်း",
      "ကြက်သွန်နီကြော်၊ ကြက်သွန်ဖြူကြော်",
      "ပဲမှုန့်အကျက်လှော်",
      "ငါးငံပြာရည်",
      "ဂေါ်ဖီထုပ် (ပါးပါးလှီး)",
      "မြေပဲဆားလှော်၊ ပုစွန်ခြောက်မှုန့်"
    ],
    "steps": [
      "ဇလုံတစ်လုံးထဲတွင် ထမင်းနှင့် ပါဝင်ပစ္စည်းများအားလုံးကို ထည့်ပါ။",
      "ငါးငံပြာရည်နှင့် ဆီအနည်းငယ်ထည့်ပြီး သမအောင် နယ်ပါ။",
      "အရသာမြည်းပြီး လိုအပ်ပါက ပြင်ဆင်သုံးဆောင်ပါ။"
    ]
  },
  {
    "id": "7",
    "name": "ဝက်သားနီချက်",
    "image": "https://i.ytimg.com/vi/3wG0dVJy1mc/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLDsYs3wNG1dXM1ypH0m7i0yAfzOTQ",
    "duration": "၁ နာရီ ၃၀ မိနစ်",
    "serving": "၄ ယောက်စာ",
    "category": 2,
    "rating": "4.4",
    "ingredients": [
      "ဝက်သုံးထပ်သား ၅၀၀ ဂရမ်",
      "ပဲငံပြာရည်အနောက် စားပွဲတင်ဇွန်း ၃ ဇွန်း",
      "ပဲငံပြာရည်အကြည် စားပွဲတင်ဇွန်း ၁ ဇွန်း",
      "ချင်း၊ ကြက်သွန်ဖြူ",
      "နာနတ်ပွင့် ၂ ပွင့်",
      "သကြား စားပွဲတင်ဇွန်း ၁ ဇွန်း"
    ],
    "steps": [
      "ဝက်သားကို အနေတော်တုံးပြီး ဆား၊ နနွင်းတို့ဖြင့် နယ်ပါ။",
      "သကြားကို ဒယ်အိုးထဲထည့်ပြီး အရည်ပျော်ကာ အညိုရောင်သန်းလာသည်အထိ ကျိုပါ။",
      "ဝက်သားထည့်ပြီး အရောင်ဝင်အောင် မွှေပါ။",
      "ချင်း၊ ကြက်သွန်ဖြူ၊ နာနတ်ပွင့်နှင့် ပဲငံပြာရည်များထည့်ပါ။",
      "ရေမြုပ်အောင်ထည့်ပြီး အဖုံးအုပ်ကာ မီးအေးအေးဖြင့် ဝက်သားနူးအိပြီး ဆီပြန်သည်အထိ ချက်ပါ။"
    ]
  },
  {
    "id": "8",
    "name": "တို့ဟူးနွေး",
    "image": "https://i.ytimg.com/vi/VjE3-9nguAM/maxresdefault.jpg",
    "duration": "မိနစ် ၃၀",
    "serving": "၂ ယောက်စာ",
    "category": 1,
    "rating": "4.8",
    "ingredients": [
      "ကုလားပဲမှုန့် (Besan) ၁ ခွက်",
      "ရေ ၄ ခွက်",
      "နနွင်းမှုန့် လက်ဖက်ရည်ဇွန်းတစ်ဝက်",
      "ဆား",
      "ဆန်ခေါက်ဆွဲ (သို့) မုန့်ဖတ်",
      "မြေပဲ၊ ကြက်သွန်မြိတ်၊ နံနံပင်",
      "ငရုတ်သီးဆီချက်၊ ပဲငံပြာရည်အကြည်"
    ],
    "steps": [
      "ကုလားပဲမှုန့်၊ နနွင်း၊ ဆားနှင့် ရေတို့ကို အိုးတစ်လုံးထဲထည့်ပြီး သမအောင် မွှေပါ။",
      "မီးအလယ်အလတ်ဖြင့် အဆက်မပြတ်မွှေပေးပါ။ တို့ဟူးအရည်များ ပျစ်ခဲလာသည်အထိတည်ပါ။",
      "ပန်းကန်ထဲတွင် ခေါက်ဆွဲဖတ်ထည့်ပါ။",
      "အပေါ်မှ ချက်ထားသော တို့ဟူးနွေးအရည်ပူပူကို လောင်းထည့်ပါ။",
      "မြေပဲ၊ ကြက်သွန်မြိတ်၊ နံနံပင်၊ ငရုတ်သီးဆီချက်တို့ဖြင့် သုံးဆောင်ပါ။"
    ]
  },
  {
    "id": "9",
    "name": "ဂျင်းသုပ်",
    "image": "https://shop.shwebiz.com/cdn/shop/products/291971815_460143849274717_8438372039424217000_n.jpg?v=1660562893&width=1445",
    "duration": "မိနစ် ၂၀",
    "serving": "၂ ယောက်စာ",
    "category": 3,
    "rating": "4.2",
    "ingredients": [
      "ဂျင်းချဉ် လက်တစ်ဆုပ်စာ",
      "ဂေါ်ဖီထုပ် (ပါးပါးလှီး)",
      "ခရမ်းချဉ်သီး (အစေ့ထုတ်၊ ပါးပါးလှီး)",
      "ပဲကြော်စုံ",
      "မြေပဲဆားလှော်",
      "ပုစွန်ခြောက်မှုန့်",
      "ငံပြာရည်၊ သံပုရာရည်၊ ဆီ"
    ],
    "steps": [
      "ဂျင်းချဉ်ကို ရေစင်အောင်ညှစ်ပြီး အမျှင်လေးတွေဖြစ်အောင် ဆွဲဖြဲပါ။",
      "ပါဝင်ပစ္စည်းများအားလုံးကို ဇလုံတစ်လုံးထဲသို့ ထည့်ပါ။",
      "ငံပြာရည်၊ သံပုရာရည်၊ ဆီအနည်းငယ်ထည့်ပြီး သမအောင် နယ်ပါ။",
      "အရသာမြည်းပြီး လိုအပ်သလို ပြင်ဆင်သုံးဆောင်ပါ။"
    ]
  },
  {
    "id": "10",
    "name": "မုန့်တီ",
    "image": "https://images.deliveryhero.io/image/fd-mm/LH/gnde-listing.jpg",
    "duration": "၁ နာရီ",
    "serving": "၄ ယောက်စာ",
    "category": 1,
    "rating": "4.1",
    "ingredients": [
      "ငါးရွှေ (သို့) ငါးခူ ၃၀၀ ဂရမ်",
      "မုန့်တီဖတ်",
      "စပါးလင်၊ ကြက်သွန်ဖြူ၊ ငရုတ်ကောင်းမှုန့်",
      "ငါးငံပြာရည်",
      "ငရုတ်သီးစိမ်း၊ နံနံပင်",
      "အကြော် (ပဲကြော်၊ ဗူးသီးကြော်)"
    ],
    "steps": [
      "ငါးကို စပါးလင်၊ ကြက်သွန်ဖြူတို့ဖြင့် ပြုတ်ပြီး အရိုးနွှင်ထားပါ။",
      "ငါးပြုတ်ရည်ကို စစ်ပြီး ဟင်းရည်အိုးအဖြစ် ပြန်တည်ပါ။",
      "နွှင်ထားသော ငါးအသား၊ ငရုတ်ကောင်းမှုန့်၊ ငံပြာရည်တို့ထည့်ပြီး အရသာသွင်းပါ။",
      "ပန်းကန်ထဲတွင် မုန့်တီဖတ်ထည့်ပြီး ဟင်းရည်ပူပူလောင်းထည့်ပါ။",
      "ငရုတ်သီးစိမ်း၊ နံနံပင်၊ အကြော်တို့ထည့်ပြီး သုံးဆောင်ပါ။"
    ]
  }
]